DiplomArs4/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomArs4/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АбоненскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЗаВыполненныеРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВыставленоКлиенту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

DiplomArs4/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОкончаниеДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбоненскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

DiplomArs4/src/Documents/РеализацияТоваровУслуг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказПокупателя.Организация КАК Организация,
	|	ЗаказПокупателя.Контрагент КАК Контрагент,
	|	ЗаказПокупателя.Договор КАК Договор,
	|	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	|	ЗаказПокупателя.Товары.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Товары,
	|	ЗаказПокупателя.Услуги.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Услуги
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
	//++ Арсеньева Дипломный проект 22.11.2025
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатурыРаботыСпециалиста.Получить();
	НоменклатураАбоненскаяПлата = Константы.ВКМ_НоменклатураАбоненскаяПлата.Получить();
	
	Для Каждого Строка Из Товары Цикл
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Клиент = Контрагент;
		Движение.Договор = Договор;
		
		Если Строка.Номенклатура = НоменклатураРаботыСпециалиста Тогда 
			
			Движение.КоличествоЧасов = Строка.Количество;
			Движение.СуммаЗаВыполненныеРаботы = Строка.Сумма;
			
		ИначеЕсли  Строка.Номенклатура = НоменклатураАбоненскаяПлата Тогда 
			Движение.АбоненскаяПлата = Строка.Сумма;
		Иначе		
			
			Продолжить;
			
		КонецЕсли;
		
		Движение.СуммаВыставленоКлиенту = Движение.СуммаЗаВыполненныеРаботы + Движение.АбоненскаяПлата;
		
	КонецЦикла;
	//--
	
КонецПроцедуры

//++ Арсеньева Дипломный проект 22.11.2025
Процедура ВыполнитьАвтозаполнение()Экспорт
	
	НоменклатураАбоненскаяПлата = Константы.ВКМ_НоменклатураАбоненскаяПлата.Получить();
	НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатурыРаботыСпециалиста.Получить();
	
	Если Не ЗначениеЗаполнено(НоменклатураАбоненскаяПлата) Тогда		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо заполнить константу: НоменклатураАбоненскаяПлата";
		Возврат;
	КонецЕсли; 
	
	Если Не  ЗначениеЗаполнено(НоменклатураРаботыСпециалиста) Тогда		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо заполнить константу: НоменклатураРаботыСпециалиста";
		Возврат;
	КонецЕсли;
	
	Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты.КоличествоЧасовПриход КАК ЧасыКОплате1,
	|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты.СуммаЗаВыполненныеРаботыПриход, 0) КАК СуммаЗаВыполненныеРаботы1,
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВКМ_СуммаАбоненскойПлаты, 0) КАК СуммаАбоненскойПлаты,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовПриход КАК ЧасыКОплате,
	|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаЗаВыполненныеРаботыПриход, 0) КАК СуммаЗаВыполненныеРаботы
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоПериода, &КонецПериода, Месяц, ) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Месяц, , ) КАК ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты
	|			ПО ДоговорыКонтрагентов.Ссылка = ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты.Договор.Ссылка
	|		ПО ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора < &НачалоПериода
	|	И ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора > &КонецПериода
	|	И ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Договор);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.СуммаАбоненскойПлаты <> 0 Тогда
			НоваяСтрока1 = Товары.Добавить();
			НоваяСтрока1.Номенклатура = НоменклатураАбоненскаяПлата;
			НоваяСтрока1.Сумма = Выборка.СуммаАбоненскойПлаты;
		Иначе Возврат;
		КонецЕсли;
		
		Если Выборка.СуммаЗаВыполненныеРаботы <> 0 Тогда
			НоваяСтрока2 = Товары.Добавить();
			НоваяСтрока2.Номенклатура = НоменклатураРаботыСпециалиста;
			НоваяСтрока2.Количество = Выборка.ЧасыКОплате;
			НоваяСтрока2.Сумма = Выборка.СуммаЗаВыполненныеРаботы;
		Иначе Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//--

#КонецОбласти

#КонецЕсли
